tutorials/incompressible/icoDyMFoam/movingBlockRBF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   DIC;

        tolerance        1e-06;
        relTol           0;
    }

    pFinal
    {
        solver           CG;
        preconditioner   DIC;

        tolerance        1e-06;
        relTol           0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance        1e-7;
        relTol           0;
    }
}

PISO
{
    checkMeshCourantNo true;
    momentumPredictor yes;

    nCorrectors     4;
    nNonOrthogonalCorrectors 1;

    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
